In [15]:

import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [42]:
datos = pd.read_csv('xx.csv',delimiter=',')
datos

,precios,nombre_producto
0,"$174.993,$249.990,$249.990,$139.993,$139.993,$...",\n MEN'S STRETC...

In [43]:
precios = datos['precios']
precios

0    $174.993,$249.990,$249.990,$139.993,$139.993,$...
Name: precios, dtype: object

In [ ]:
nombres_productos = datos['nombre_producto']
nombres_productos = nombres_productos.str.replace("\n                                ","")
nombres_productos = nombres_productos.str.replace("                            ","")
nombres_productos = nombres_productos.str.replace("\n",",")
nombres_productos

spliteamos las comas en columnas y sacamos la traspuesta con .T

In [ ]:
nombres_productos = nombres_productos.str.split(",", expand=True).T
nombres_productos

In [46]:
precios = precios.str.split(",", expand=True).T

In [64]:
df_final = df_final.drop_duplicates()

In [66]:
df_final = pd.concat([nombres_productos, precios],axis=1)

In [13]:
headerList = ['Nombre_Producto','Precio']
df_final.to_excel('final.xlsx',header=headerList, index=False)

In [49]:
print(type(df_final))

<class 'pandas.core.frame.DataFrame'>

In [57]:
df_final.nunique()

NombreProducto    173
Precio             83
dtype: int64

In [50]:
df_final.columns = ['NombreProducto', 'Precio']

In [59]:
df_final = df_final.drop_duplicates()

In [56]:
df_final.describe(include='all')

                   NombreProducto   Precio
count                         194      194
unique                        173       83
top     MEN'S STRETCH DOWN JACKET  $29.990
freq                            2       18

In [60]:
df_final

                         NombreProducto    Precio
0             MEN'S STRETCH DOWN JACKET  $174.993
1             MEN'S STRETCH DOWN JACKET  $249.990
2          CHAQUETA STRETCH DOWN HOMBRE  $249.990
3    CHAQUETA THERMOBALL ECO 2.0 HOMBRE  $139.993
6             CHAQUETA VENTURE 2 HOMBRE   $79.992
..                                  ...       ...
311              M SPRAG 5-POCKET PANTS   $38.994
312  MEN'S GORDON LYONS FULL-ZIP JACKET   $59.994
314        MEN'S THERMOBALL™ ECO JACKET  $101.994
315               MEN'S VENTRIX™ JACKET  $101.994
317             GUANTE MUJER APEX ETIP™   $26.994

[194 rows x 2 columns]

In [63]:
df_final.to_csv('resultado.csv', index=False)

In [ ]:
df_final.to_sql